.web/blog/fat32-partitionless-voidlinux-liveusb.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-07-20 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>FAT32 Partitionless Void Linux Live USB</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Dash Eclipse">
<meta name="description" content="Install Void Linux LiveOS on A FAT32 Partitionless USB Stick, Works for Both UEFI and Legacy BIOS"
>
<meta name="keywords" content="voidlinux, liveusb, liveos, refind, syslinux, uefi, legacy bios">
<link rel='icon' type='image/x-icon' href='/favicon.svg'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/styles/topnav.css' type='text/css'/>
<link rel='stylesheet' href='/styles/site.css' type='text/css'/>
<link rel='stylesheet' href='/styles/syntax-coloring.css' type='text/css'/>
<link rel='alternate' type='application/rss+xml' title='RSS' href='/blog/rss.xml'>
</head>
<body>
<header id="top" class="status">
<div>
<ul class='topnav'>
<li class='home'><a href='/#dash'>ezup.dev</a></li>
<li><a class='active' href='./'>Blog</a></li>
<li><a href='/#pgp'>PGP</a></li>
<li><a href='/git/' target='_blank'><u>Git</u></a></li>
<li class='right'><a href='/#about'>About</a></li>
</ul>
</div>
</header>
<main id="content">
<header>
<h1 class="title">FAT32 Partitionless Void Linux Live USB</h1>
<p class="subtitle">Published on 2020-07-14 by Dash Eclipse</p>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org88467f7">1. What is this about and why do I create Live USB this way</a>
<ul>
<li><a href="#org18b3c9e">1.1. Advantages</a></li>
<li><a href="#orgd229da0">1.2. How does it work?</a></li>
</ul>
</li>
<li><a href="#org51600eb">2. FAT32 filesystem creation and file directory structure</a></li>
<li><a href="#orgcd59278">3. UEFI</a></li>
<li><a href="#orgfc6e831">4. Legacy BIOS</a>
<ul>
<li><a href="#orgeb07aea">4.1. Minimal config</a></li>
<li><a href="#orgfc222c9">4.2. Graphical boot menu</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<section id="outline-container-org88467f7" class="outline-2">
<h2 id="org88467f7"><span class="section-number-2">1</span> What is this about and why do I create Live USB this way</h2>
<div class="outline-text-2" id="text-1">
<p>
I use void-live as my Live USB because it supports booting into RAM, so I can eject USB stick after boot into LiveOS. And it's esay to use void-mklive to generate customized iso, it's simple and just works.
</p>

<p>
But I don't want to use <code>dd</code> to write iso to my USB stick each time I need to use Live USB, or use a dedicated USB stick for the LiveOS. I can't use the USB stick to store other files once I create Live USB this way.
</p>

<p>
The solution is pretty simple, just create one FAT32 filesystem on the USB stick without any partition table, install bootloaders and copy LiveOS to it, and then configure the bootloader to boot the LiveOS.
</p>
</div>

<div id="outline-container-org18b3c9e" class="outline-3">
<h3 id="org18b3c9e"><span class="section-number-3">1.1</span> Advantages</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Works for both UEFI and Legacy BIOS</li>
<li>Maximally use the storage, everything in one filesystem</li>
<li>Could still use the USB stick for storing files as noraml</li>
<li>Easy to delete the LiveOS from the USB stick, just remove these files</li>
<li>Simple and just works, no dirty hacks, no need to load iso files</li>
<li>No need to install boot code<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></li>
</ul>
</div>
</div>

<div id="outline-container-orgd229da0" class="outline-3">
<h3 id="orgd229da0"><span class="section-number-3">1.2</span> How does it work?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
It's pretty simple, just install the bootloader, configure it to load <code>vmlinuz</code> the linux kernel and <code>initrd</code> the initramfs and it will load <code>LiveOS/squashfs.img</code> from the FAT32 filesystem which labeled as <code>VOID_​LIVE</code>.
</p>

<p>
Just install bootloaders for UEFI and Legacy BIOS, I choose rEFInd for UEFI and syslinux for Legacy BIOS.
</p>

<p>
For UEFI, a FAT32 filesystem is necessary for loading a boot manager or bootloader, the FAT32 filesystem does not necessarily need to be inside a GPT or MBR partition table, it could on the whole device without any partition table (a.k.a. partitionless).
</p>

<p>
For Legacy BIOS, when you have a partition table on the hard drive, you need to install the boot code to the device to be able to boot from it, and the partition which contains the bootloader should be marked as <b>active</b>. But you don't need to install boot code for a partitionless setup<sup><a id="fnr.1.100" class="footref" href="#fn.1">1</a></sup>, it just boots from the filesystem.
</p>
</div>
</div>
</section>

<section id="outline-container-org51600eb" class="outline-2">
<h2 id="org51600eb"><span class="section-number-2">2</span> FAT32 filesystem creation and file directory structure</h2>
<div class="outline-text-2" id="text-2">
<p>
Assume the USB stick where we are going to create Live USB on is <code>/dev/sdc</code> and the FAT32 volume name is <code>VOID_LIVE</code>, you can create it with this command. Note the volume name can be other value but must be identical as boot options specified in bootloader configuration files.
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo mkfs.vfat -I -F32 -n VOID_LIVE /dev/sdc
</pre>
</div>

<ul class="org-ul">
<li><code>LiveOS/</code> linux kernel, initramfs and LiveOS from void-live <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></li>
<li><code>EFI/</code> rEFInd stuff for UEFI boot</li>
<li><code>syslinux/</code> syslinux stuff for legacy BIOS boot</li>
</ul>
<p>
Boot options can be found in <code>boot/isolinux/isolinux.cfg</code> or <code>boot/grub/grub_void.cfg</code> from void-live iso.
</p>
<pre style="line-height:1;">
VOID_LIVE
├── EFI
│   ├── BOOT
│   │   ├── BOOTX64.EFI
│   │   └── refind.conf
│   └── refind
│       ├── refind.conf
│       └── refind_x64.efi
├── LiveOS
│   ├── initrd
│   ├── squashfs.img
│   └── vmlinuz
└── syslinux
    ├── ldlinux.c32
    ├── ldlinux.sys
    └── syslinux.cfg

5 directories, 10 files
</pre>
</div>
</section>

<section id="outline-container-orgcd59278" class="outline-2">
<h2 id="orgcd59278"><span class="section-number-2">3</span> UEFI</h2>
<div class="outline-text-2" id="text-3">
<p>
I use rEFInd Boot Manager for UEFI boot, you can just download it from <a href="https://www.rodsbooks.com/refind/getting.html">the official website</a> and copy it to the FAT32 filesystem, or install <code>refind</code> the voidlinux package and then copy it from <code>/usr/share/refind</code>. It looks better with themes such like <a href="https://github.com/munlik/refind-theme-regular">refind-theme-regular</a>. You are free to customize it.
</p>

<p>
<code>EFI/{BOOT,refind}/refind.conf</code>
</p>
<pre class="example">
timeout 20

menuentry "Void Linux (x86_64-musl)" {
    loader LiveOS/vmlinuz
    initrd /LiveOS/initrd
    options "root=live:CDLABEL=VOID_LIVE ro init=/sbin/init rd.luks=0 rd.md=0 rd.dm=0 loglevel=4 gpt add_efi_memmap vconsole.unicode=1 vconsole.keymap=dvorak-programmer locale.LANG=en_US.UTF-8  rd.live.overlay.overlayfs=1"
}

menuentry "Void Linux (x86_64-musl) (RAM)" {
    loader LiveOS/vmlinuz
    initrd /LiveOS/initrd
    options "root=live:CDLABEL=VOID_LIVE ro init=/sbin/init rd.luks=0 rd.md=0 rd.dm=0 loglevel=4 gpt add_efi_memmap vconsole.unicode=1 vconsole.keymap=dvorak-programmer locale.LANG=en_US.UTF-8  rd.live.overlay.overlayfs=1  rd.live.ram"
}
</pre>
</div>
</section>

<section id="outline-container-orgfc6e831" class="outline-2">
<h2 id="orgfc6e831"><span class="section-number-2">4</span> Legacy BIOS</h2>
<div class="outline-text-2" id="text-4">
<p>
I use syslinux because it's more lightweight than grub, <code>syslinux</code> the package is required to install syslinux to USB stick. You can use the minimal config or graphical boot menu config, I recommend to use the minimal one.
</p>
</div>

<div id="outline-container-orgeb07aea" class="outline-3">
<h3 id="orgeb07aea"><span class="section-number-3">4.1</span> Minimal config</h3>
<div class="outline-text-3" id="text-4-1">
<p>
To avoid syslinux <code>Boot Error</code> I just use this minimal configuration without any non-core syslinux modules, and only run the extlinux/syslinux command once. I recommend you to create the Live USB in this order.
</p>

<ol class="org-ol">
<li>Create FAT32 filesystem</li>
<li>mount it to VOID_​LIVE, create VOID_​LIVE/syslinux/ folder</li>
<li>Install syslinux with <code>extlinux --install VOID_LIVE/syslinux</code></li>
<li>Add syslinux/syslinux.cfg and LiveOS/{vmlinuz,initrd,squashfs.img}</li>
</ol>

<p>
<code>syslinux/syslinux.cfg</code>
</p>
<pre class="example">
PROMPT 1
TIMEOUT 50
DEFAULT voidram

LABEL void
	LINUX /LiveOS/vmlinuz
	APPEND initrd=/LiveOS/initrd root=live:CDLABEL=VOID_LIVE init=/sbin/init ro rd.luks=0 rd.md=0 rd.dm=0 loglevel=4 vconsole.unicode=1 vconsole.keymap=dvorak-programmer locale.LANG=en_US.UTF-8  rd.live.overlay.overlayfs=1

LABEL voidram
	LINUX /LiveOS/vmlinuz
	APPEND initrd=/LiveOS/initrd root=live:CDLABEL=VOID_LIVE init=/sbin/init ro rd.luks=0 rd.md=0 rd.dm=0 loglevel=4 vconsole.unicode=1 vconsole.keymap=dvorak-programmer locale.LANG=en_US.UTF-8  rd.live.overlay.overlayfs=1  rd.live.ram
</pre>
</div>
</div>

<div id="outline-container-orgfc222c9" class="outline-3">
<h3 id="orgfc222c9"><span class="section-number-3">4.2</span> Graphical boot menu</h3>
<div class="outline-text-3" id="text-4-2">
<p>
You can check <code>boot/isolinux/{*.c32,isolinux.cfg}</code> from void-live iso for dependencies and config to use graphical boot menu, but from my experience you need to create the Live USB in this order to avoid syslinux <code>Boot Error</code> (not able to boot), especially when the squashfs.img is large.
</p>

<ol class="org-ol">
<li>Create FAT32 filesystem</li>
<li>mount it to VOID_​LIVE</li>
<li>Add <code>syslinux/{chain,libcom32,libutil,vesamenu}.c32</code> (from <code>/usr/lib/syslinux</code>), <code>/syslinux.cfg</code> (optionally <code>splash.png</code>), and <code>LiveOS/{vmlinuz,initrd}</code></li>
<li>Install syslinux with <code>extlinux --install VOID_LIVE/syslinux</code></li>
<li>Add VOID_​LIVE/LiveOS/squashfs.img</li>
<li>umount VOID_​LIVE</li>
</ol>

<p>
Note it may won't able to boot if you change any of files syslinux may load, including kernel and initramfs. Reinstall syslinux to the USB stick won't help and the only solution I know is recreate the FAT32 filesystem and start over again.
</p>
</div>
</div>
</section>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://unix.stackexchange.com/a/103568">For Legacy BIOS, Using a filesystem without a partition table thus not only saves space, but also a step in the boot process.</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Use the official <a href="https://voidlinux.org/download/">void-live</a> or create your own iso by using <a href="https://github.com/void-linux/void-mklive">void-mklive</a>
</p></div></div>


</div>
</div></main>
</body>
</html>
